backend/app/graphql/types/director_type.rb

    def movies_count
        object.movies.size
---
SELECT COUNT(*) FROM "movies" WHERE "movies"."director_id" = ?  [["director_id", 1]]