backend/app/graphql/types/query_type.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def movie(id:)
      Movie.find(id)